In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan
n

nan

In [3]:
type(n)

float

In [4]:
m = 1
m + n

nan

# Nan = Not a number

# Nan in Series

In [6]:
s1 = Series([1,2, n, 3,4], index=['A','B','C','D','E'])
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [7]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [8]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [9]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

# Nan in DataFrame

In [10]:
df = DataFrame([[1,2,3],[n,5,6],[7,n,9],[n,n,n]])
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [11]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [12]:
df.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [14]:
df.dropna()

     0    1    2
0  1.0  2.0  3.0

In [15]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [16]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [17]:
df.dropna(axis=0, how='any')

     0    1    2
0  1.0  2.0  3.0

In [18]:
df.dropna(axis=0, how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [19]:
df2 = DataFrame([[1,2,3,n],[2,n,5,6],[n,7,n,9],[1,n,n,n]])
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [25]:
df2.dropna(axis=0, how='all')

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [26]:
df2.dropna(thresh=None)

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [27]:
df2.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [28]:
df2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [29]:
df2.fillna(value=1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [31]:
df2.fillna(value={0:0,1:1,2:2,3:3})

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [32]:
df2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN